Autodesk.Revit.DB.ExternalFileReference.IsValidPathTypeForExternalFileReference(Autodesk.Revit.DB.PathType)
Checks whether a PathType enum value will be valid to
use with this ExternalFileReference.
Remarks:
PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink
PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.IsValidExternalFileReference(Autodesk.Revit.DB.ExternalFileReference)
Checks an ExternalFileReference to see if it is
properly created.
Remarks:
The following restrictions exist:
PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal Keynote tables, assembly code tables and Decals  (ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal) may only be
LinkedFileStatus.Loaded or LinkedFileStatus.NotFound.
data:
The ExternalFileReference to be checked
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.GetReferencingId
Gets the ElementId corresponding to the element which
this ExternalFileReference is associated with.
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.GetLinkedFileStatus
Returns a LinkedFileStatus.Enum corresponding to the
load status of the referenced file.
Remarks:
Options are Invalid,
Loaded, Unloaded, NotFound, or Imported.
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.GetAbsolutePath
Returns an absolute path to the referenced file,
regardless of whether the PathType.Enum is relative or absolute.
Remarks:
ExternalFileReferences which are taken from a closed document will
report their absolute path as of the last time the document was saved.
Returns:
A full path to the linked model.
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.GetPath
Gets the path of the link, relative or absolute according
to the link's settings
Returns:
The path of the link. This path will be relative for
relatively-pathed links.
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalFileReference.ExternalFileReferenceType
The type of external file which this object
references.
Since:
2012

Autodesk.Revit.DB.ExternalFileReference.PathType
The path type of the link (relative, absolute, or server).
Since:
2012

Autodesk.Revit.DB.ExternalFileReference
A class that contains the details of a reference to a file outside of a given document.
Since:
2012